{"config": [{"config": {"padding": "valid", "use_bias": true, "name": "conv2d_1", "dtype": "float32", "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "filters": 32, "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "data_format": "channels_last", "batch_input_shape": [null, 128, 128, 3], "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_1", "beta_constraint": null, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "center": true, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"padding": "valid", "use_bias": true, "name": "conv2d_2", "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "filters": 64, "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_2", "beta_constraint": null, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "center": true, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"padding": "valid", "use_bias": true, "name": "conv2d_3", "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "filters": 64, "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_3", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_3", "beta_constraint": null, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "center": true, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"padding": "valid", "use_bias": true, "name": "conv2d_4", "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "filters": 96, "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_4", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_4", "beta_constraint": null, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "center": true, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"padding": "valid", "use_bias": true, "name": "conv2d_5", "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "filters": 32, "dilation_rate": [1, 1], "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_5", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_5", "beta_constraint": null, "gamma_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "center": true, "trainable": true, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.2, "seed": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"units": 128, "use_bias": true, "name": "dense_1", "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "noise_shape": null, "rate": 0.3, "seed": null}, "class_name": "Dropout"}, {"config": {"units": 45, "use_bias": true, "name": "dense_2", "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "activation": "softmax", "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2"}