{"backend": "tensorflow", "config": [{"config": {"bias_constraint": null, "kernel_regularizer": null, "trainable": true, "padding": "valid", "use_bias": true, "filters": 32, "dtype": "float32", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 128, 128, 3], "kernel_constraint": null, "name": "conv2d_26", "bias_regularizer": null, "data_format": "channels_last", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_26", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_26", "beta_regularizer": null, "scale": true, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "trainable": true, "padding": "valid", "use_bias": true, "name": "conv2d_27", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 64, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_27", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_27", "beta_regularizer": null, "scale": true, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "trainable": true, "padding": "valid", "use_bias": true, "name": "conv2d_28", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 64, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_28", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_28", "beta_regularizer": null, "scale": true, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "trainable": true, "padding": "valid", "use_bias": true, "name": "conv2d_29", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 96, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_29", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_29", "beta_regularizer": null, "scale": true, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "trainable": true, "padding": "valid", "use_bias": true, "name": "conv2d_30", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 32, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_30", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_30", "beta_regularizer": null, "scale": true, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"noise_shape": null, "seed": null, "trainable": true, "name": "dropout_11", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_6"}, "class_name": "Flatten"}, {"config": {"units": 128, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_11", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"noise_shape": null, "seed": null, "trainable": true, "name": "dropout_12", "rate": 0.3}, "class_name": "Dropout"}, {"config": {"units": 25, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_12", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.2.2", "class_name": "Sequential"}